Show / Hide Table of Contents
Class ParameterReferenceElement
Reference element parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterReferenceElement
Inherited Members
 Parameter.Name
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ParameterReferenceElement : Parameter
Properties
Improve this Doc   View Source
Value
Value
Declaration
public ReferenceElement Value { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source